app/views/invoices/_index.html.erb

SELECT COUNT(*) FROM "invoices" WHERE "invoices"."project_id" = ?  [["project_id", 75]]
---
<h3>Invoices</h3>
<% if @project.invoices.size != 0 %>