app/views/users/index.html.erb

<center>
<% if User.all.where.not(admin: true).where.not(manager: true).size == 0 %>
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users" WHERE ("users"."admin" != 't') AND ("users"."manager" != 't')