app/views/output_files/_index.html.erb

SELECT COUNT(*) FROM "output_files" WHERE "output_files"."project_id" = ?  [["project_id", 75]]
---
<h3>Deliveries</h3>
<% if @project.output_files.size != 0 %>