app/views/quotations/_form.html.erb

    <%= f.number_field :cost %>
    <%= f.collection_select(:currency_id, Currency.all, :id, :title, :prompt => true) %>
---
SELECT "currencies".* FROM "currencies"