app/views/quotations/_index.html.erb

<h3>Quotations</h3>
<% if @project.quotations.size != 0 %>
---
SELECT "quotations".* FROM "quotations" WHERE "quotations"."project_id" = $1  [["project_id", 1]]
SELECT COUNT(*) FROM "quotations" WHERE "quotations"."project_id" = ?  [["project_id", 75]]