app/views/projects/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.collection_select(:category_id, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"