app/views/projects/index.html.erb

SELECT "projects".* FROM "projects" WHERE "projects"."project_manager_id" = ?  [["project_manager_id", 49]]
---
        <% if project.project_manager != nil %>
        <td><center><%= project.project_manager.firstname %></center></td>

SELECT "projects".* FROM "projects" WHERE "projects"."project_owner_id" = ?  ORDER BY created_at desc  [["project_owner_id", 49]]
---
        <% if project.project_owner != nil %>
        <td><center><%= project.project_owner.firstname %> <%= project.project_owner.lastname %></center></td>