app/views/input_files/_index.html.erb

SELECT COUNT(*) FROM "input_files" WHERE "input_files"."project_id" = ?  [["project_id", 75]]
---
<h3>Client files</h3>
<% if @project.input_files.size != 0 %>