app/controllers/companies_controller.rb

  def index
    # Available only for admin and project manager
    if current_user.admin? || current_user.manager?
      @companies = Company.all
---
SELECT "companies".* FROM "companies"