app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects"  ORDER BY created_at desc
SELECT "projects".* FROM "projects" WHERE "projects"."project_owner_id" = ?  ORDER BY created_at desc  [["project_owner_id", 49]]
---
  def index
    # Get the projects to display according to the role of the user
    if current_user.admin?
      @projects = Project.all
      print 'ADMIn PROJECT '+@projects.to_s
    elsif current_user.manager?
      @projects = Project.where('project_manager_id=? OR project_owner_id=?', current_user.id, current_user.id)

INSERT INTO "projects" ("title", "description", "instruction", "category_id", "urgency", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "zd"], ["description", "d"], ["instruction", "d"], ["category_id", 1], ["urgency", "Middle"], ["created_at", "2015-03-30 14:22:39.554253"], ["updated_at", "2015-03-30 14:22:39.554253"]]
---
  def create
    @project = Project.new(project_params)
    respond_to do |format|
      if @project.save