app/controllers/quotations_controller.rb

INSERT INTO "quotations" ("file_path", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["file_path", "repart.txt"], ["name", "ef"], ["created_at", "2015-03-30 14:24:25.665317"], ["updated_at", "2015-03-30 14:24:25.665317"]]
UPDATE "projects" SET "status" = $1, "updated_at" = $2 WHERE "projects"."id" = $3  [["status", "Quote"], ["updated_at", "2015-03-30 14:24:25.672759"], ["id", 1]]
---
  def create
    @quotation = Quotation.new(quotation_params)
    respond_to do |format|
      if @quotation.save
        @quotation.update_attribute(:project_id, params[:project_id])
        # Change the project's status if Pending
        if @project.status == 'Pending'
          @project.update_attribute(:status, 'Quote')

SELECT  "quotations".* FROM "quotations" WHERE "quotations"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_quotation
      @quotation = Quotation.find(params[:id])