app/controllers/registrations_controller.rb

  def create
    super
    # Check if the new user is already invited in a new company
    invit = Invitation.all.where(email: resource.email)
    if invit.size != 0
---
SELECT COUNT(*) FROM "invitations" WHERE "invitations"."email" = $1  [["email", "nicolas.pirotte@gmail.com"]]