app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # Index only available for admins and project managers
    if !current_user.admin? && !current_user.manager?
      redirect_to projects_path, :alert => "Access denied." and return
    end
    @users = User.all